openmv/openmv/ports/stm32/omv_csi.c
            HAL_DCMIPP_DeInit(&csi->dcmipp);
            if (HAL_DCMIPP_Init(&csi->dcmipp) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Select and configure the DCMIPP source.
            DCMIPP_CSI_ConfTypeDef scfg = {
                .NumberOfLanes = DCMIPP_CSI_TWO_DATA_LANES,
                .DataLaneMapping = DCMIPP_CSI_PHYSICAL_DATA_LANES,
                .PHYBitrate = stm_csi_mipi_bitrate(csi->mipi_brate),
            };

            if (HAL_DCMIPP_CSI_SetConfig(&csi->dcmipp, &scfg) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Configure CSI virtual channel and pipe.
            DCMIPP_CSI_PIPE_ConfTypeDef csi_pcfg = {
                .DataTypeMode = DCMIPP_DTMODE_DTIDA,
                .DataTypeIDA = DCMIPP_DT_RAW10,
                .DataTypeIDB = DCMIPP_DT_RAW10,
            };

            if (HAL_DCMIPP_CSI_SetVCConfig(&csi->dcmipp, DCMIPP_VIRTUAL_CHANNEL0,
                                           DCMIPP_CSI_DT_BPP10) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            if (HAL_DCMIPP_CSI_PIPE_SetConfig(&csi->dcmipp, DCMIPP_PIPE, &csi_pcfg) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // ST software workaround for spurious DCMIPP multiline interrupts triggering the VENC hardware
            // handshake input in frame mode which crashes the VENC.
            if (HAL_DCMIPP_PIPE_EnableLineEvent(&csi->dcmipp, DCMIPP_PIPE, DCMIPP_MULTILINE_128_LINES) != HAL_OK ||
                HAL_DCMIPP_PIPE_DisableLineEvent(&csi->dcmipp, DCMIPP_PIPE) != HAL_OK) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }

            // Store CSI handle used for DCMIPP
            stm_csi_all[CSI_HANDLE_DCMIPP] = csi;

            // Configure and enable DCMI IRQ Channel
            NVIC_SetPriority(DCMIPP_IRQn, IRQ_PRI_DCMI);
            HAL_NVIC_EnableIRQ(DCMIPP_IRQn);

            // Configure and enable CSI IRQ Channel
            NVIC_SetPriority(CSI_IRQn, IRQ_PRI_DCMI);
            HAL_NVIC_EnableIRQ(CSI_IRQn);
            #endif
        }
    } else if (config == OMV_CSI_CONFIG_DEINIT) {
        if (!csi->mipi_if) {
            HAL_NVIC_DisableIRQ(DCMI_IRQn);
            HAL_DCMI_DeInit(&csi->dcmi);
        } else {
            #if USE_DCMIPP
            HAL_NVIC_DisableIRQ(DCMIPP_IRQn);
            HAL_DCMIPP_DeInit(&csi->dcmipp);
            #endif
        }
    } else if (config == OMV_CSI_CONFIG_PIXFORMAT) {
        if (!csi->mipi_if) {
            DCMI->CR &= ~(DCMI_CR_JPEG_Msk << DCMI_CR_JPEG_Pos);
            DCMI->CR |= (csi->pixformat == PIXFORMAT_JPEG) ? DCMI_JPEG_ENABLE : DCMI_JPEG_DISABLE;
            #if defined(STM32N6)
            // Handle YUV422 Source -> Y Destination using DCMI byte drop.
            if (csi->pixformat == PIXFORMAT_GRAYSCALE && csi->mono_bpp == 2) {
                DCMI->CR |= DCMI_CR_BSM_0;
            } else {
                DCMI->CR &= ~DCMI_CR_BSM_0;
            }

            // Turn on/off byte swapping for RGB/YUV formats.
            for (size_t i = 0; i < OMV_ARRAY_SIZE(dma_nodes); i++) {
                if ((csi->pixformat == PIXFORMAT_RGB565 && csi->rgb_swap) ||
                    (csi->pixformat == PIXFORMAT_YUV422 && csi->yuv_swap)) {
                    dma_nodes[i].LinkRegisters[NODE_CTR1_DEFAULT_OFFSET] |= DMA_CTR1_DBX;
                } else {
                    dma_nodes[i].LinkRegisters[NODE_CTR1_DEFAULT_OFFSET] &= ~DMA_CTR1_DBX;
                }
            }
            #endif
        } else {
            #if USE_DCMIPP
            csi->dcmipp.State = HAL_DCMIPP_STATE_READY;
            // Reset pipes states to allow reconfiguring them.
            for (size_t i = 0; i < DCMIPP_NUM_OF_PIPES; i++) {
                csi->dcmipp.PipeState[i] = HAL_DCMIPP_PIPE_STATE_RESET;
            }
            // Configure the pixel processing pipeline.
            if (stm_isp_init(csi, DCMIPP_PIPE, csi->pixformat, csi->raw_output)) {
                return OMV_CSI_ERROR_CSI_INIT_FAILED;
            }
            #endif
        }
    }

    return 0;
}

// Stop the DCMI from generating more DMA requests, and disable the DMA.
static int stm_csi_abort(omv_csi_t *csi, bool fifo_flush, bool in_irq) {
    if (!stm_csi_is_active(csi)) {
        return 0;
    }

    if (!csi->mipi_if) {
        DCMI->CR &= ~DCMI_CR_ENABLE;
        while (DCMI->CR & DCMI_CR_ENABLE) {
            ;
        }

        #if defined(STM32N6)
        HAL_DMA_Abort(&csi->dma);
        #else
        if (in_irq) {
            HAL_DMA_Abort_IT(&csi->dma);
        } else {
            HAL_DMA_Abort(&csi->dma);
        }
        #endif
        HAL_NVIC_DisableIRQ(csi->dma_irqn);

        #if USE_MDMA
        if (!in_irq) {
            HAL_MDMA_Abort(&csi->mdma0);
            HAL_MDMA_Abort(&csi->mdma1);
        }
        HAL_MDMA_DeInit(&csi->mdma0);
        HAL_MDMA_DeInit(&csi->mdma1);
        #endif

        __HAL_DCMI_DISABLE_IT(&csi->dcmi, DCMI_IT_FRAME);
        __HAL_DCMI_CLEAR_FLAG(&csi->dcmi, DCMI_FLAG_FRAMERI);
    } else {
        #if USE_DCMIPP
        HAL_DCMIPP_CSI_PIPE_Stop(&csi->dcmipp, DCMIPP_PIPE, DCMIPP_VIRTUAL_CHANNEL0);
        #endif // USE_DCMIPP
    }
    return 0;
}

static int stm_csi_shutdown(omv_csi_t *csi, int enable) {
    int ret = 0;
    if (enable) {
        ret = omv_csi_config(csi, OMV_CSI_CONFIG_DEINIT);
    } else {
        ret = omv_csi_config(csi, OMV_CSI_CONFIG_INIT);
    }
    return ret;
}

static uint32_t stm_clk_get_frequency(omv_clk_t *clk) {
    if (!clk->tim.Instance) {
        return 0;
    }
    return stm_pwm_get_frequency(&clk->tim, OMV_CSI_TIM_CHANNEL);
}

static int stm_clk_set_frequency(omv_clk_t *clk, uint32_t frequency) {
    #if (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_MCO)
    // Pass through the MCO1 clock with source input set to HSE (12MHz).
    // Note MCO1 is multiplexed on OPENMV2/TIM1 only.
    HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSE, RCC_MCODIV_1);
    #elif (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_OSC)
    // An external oscillator is used for the csi clock.
    // Configure and enable external oscillator if needed.
    #elif (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_TIM)
    if (stm_pwm_start(&clk->tim, OMV_CSI_TIM, OMV_CSI_TIM_CHANNEL, frequency)) {
        return OMV_CSI_ERROR_TIM_INIT_FAILED;
    }
    #else
    #error "OMV_CSI_CLK_SOURCE is not set!"
    #endif // (OMV_CSI_CLK_SOURCE == OMV_CSI_CLK_SOURCE_TIM)
    return 0;
}

int omv_csi_set_vsync_callback(omv_csi_t *csi, omv_csi_cb_t cb) {
    if (cb.fun == NULL) {
        #if (DCMI_VSYNC_EXTI_SHARED == 0)
        // Disable VSYNC EXTI IRQ
        omv_gpio_irq_enable(OMV_CSI_VSYNC_PIN, false);
        #endif
    } else {
        // Enable VSYNC EXTI IRQ
        omv_gpio_irq_register(OMV_CSI_VSYNC_PIN, cb.fun, cb.arg);
        omv_gpio_irq_enable(OMV_CSI_VSYNC_PIN, true);
    }
    return 0;
}

// If the image is cropped by more than 1 word in width, align the line start to a word
// address to improve copy performance. Do not crop by more than 1 word as this will
// result in less time between DMA transfers complete interrupts on 16-byte boundaries.
static uint32_t get_dcmi_hw_crop(omv_csi_t *csi, uint32_t bytes_per_pixel) {
    framebuffer_t *fb = csi->fb;
    uint32_t byte_x_offset = (fb->x * bytes_per_pixel) % 4;
    uint32_t width_remainder = (csi->resolution[csi->framesize][0] - (fb->x + fb->u)) * bytes_per_pixel;

    if (byte_x_offset && (width_remainder >= (4 - byte_x_offset))) {
        return byte_x_offset;
    }

